public_html/Linux/summarize.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Summarize</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Summarize"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-30 10:07:36 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Summarize</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">General</a>
<ul>
<li><a href="#sec-1-1">linux journal</a></li>
<li><a href="#sec-1-2">Linux Documentation</a></li>
<li><a href="#sec-1-3">http://linuxcommand.org/</a></li>
<li><a href="#sec-1-4">Davin's collection of unix programming links</a></li>
</ul>
</li>
<li><a href="#sec-2">Bash</a>
<ul>
<li><a href="#sec-2-1">learning the shell</a></li>
<li><a href="#sec-2-2">Writing Shell Scripts</a></li>
<li><a href="#sec-2-3">The Bash Reference Manual</a></li>
<li><a href="#sec-2-4">Greg's Wiki</a></li>
<li><a href="#sec-2-5">Bash Hacker's Wiki</a></li>
<li><a href="#sec-2-6">Chet Ramey's Bash Page</a></li>
<li><a href="#sec-2-7">Heiner's SHELLdorado</a></li>
<li><a href="#sec-2-8">Advanced Bash Scripting HOWTO</a></li>
<li><a href="#sec-2-9">The Bash Prompt HOWTO</a></li>
<li><a href="#sec-2-10">Linux From Scratch</a></li>
</ul>
</li>
<li><a href="#sec-3"></a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">General</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">linux journal</h3>
<div class="outline-text-3" id="text-1-1">

<p><a href="http://www.linuxjournal.com/">http://www.linuxjournal.com/</a>
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Linux Documentation</h3>
<div class="outline-text-3" id="text-1-2">

<p><a href="http://linux.die.net/">http://linux.die.net/</a>
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><a href="http://linuxcommand.org/">http://linuxcommand.org/</a></h3>
<div class="outline-text-3" id="text-1-3">


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Davin's collection of unix programming links</h3>
<div class="outline-text-3" id="text-1-4">

<p><a href="http://www.cse.buffalo.edu/~milun/unix.programming.html">http://www.cse.buffalo.edu/~milun/unix.programming.html</a>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Bash</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">learning the shell</h3>
<div class="outline-text-3" id="text-2-1">

<p><a href="http://linuxcommand.org/lc3_learning_the_shell.php">http://linuxcommand.org/lc3_learning_the_shell.php</a>
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Writing Shell Scripts</h3>
<div class="outline-text-3" id="text-2-2">

<p><a href="http://linuxcommand.org/lc3_writing_shell_scripts.php">http://linuxcommand.org/lc3_writing_shell_scripts.php</a>
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">The Bash Reference Manual</h3>
<div class="outline-text-3" id="text-2-3">

<p><a href="http://www.gnu.org/software/bash/manual/bash.html">http://www.gnu.org/software/bash/manual/bash.html</a>
</p>
<p>
Perhaps in response to the usability issues found in the bash man page, the GNU Project produced the Bash Reference Manual. You can think of it as the bash man page translated into human readable form. While it lacks a tutorial focus and contains no usage examples, it is much easier to read and is more usefully organized than the bash man page.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Greg's Wiki</h3>
<div class="outline-text-3" id="text-2-4">

<p><a href="http://mywiki.wooledge.org/">http://mywiki.wooledge.org/</a>
</p>
<p>
The bash man page and the Bash Reference Manual both extensively document the features found in bash. However, when we want a description of bash behavior, different resources are needed. The best by far is Greg's Wiki. This site covers a variety of topics, but of particular interest to us are the Bash FAQ which contains over one hundred frequently asked questions about bash, the Bash Pitfalls which describes many of the common problems script writers encounter with bash, and the Bash Guide, a useful set of tutorials for bash users. There are also several fun to read rants.
</p>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5">Bash Hacker's Wiki</h3>
<div class="outline-text-3" id="text-2-5">

<p><a href="http://wiki.bash-hackers.org/start">http://wiki.bash-hackers.org/start</a>
</p>
<p>
Like Greg's Wiki, the Bash Hackers Wiki provides many different articles relating to bash, its features, and its behavior. Included are some useful tutorials on various programming techniques and issues with scripting with bash. While the writing is, at times, a little chaotic, it does contain useful information.
</p>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6">Chet Ramey's Bash Page</h3>
<div class="outline-text-3" id="text-2-6">

<p><a href="http://tiswww.case.edu/php/chet/bash/bashtop.html">http://tiswww.case.edu/php/chet/bash/bashtop.html</a>
</p>
<p>
Chet Ramey is the current maintainer of bash and he has his own page. On it, you can find version information, latest news, and other things. The most useful document on the Bash Page is its version of the Bash FAQ. The NEWS file contains a concise list of features that have been added to each version of bash.
</p>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7">Heiner's SHELLdorado</h3>
<div class="outline-text-3" id="text-2-7">

<p><a href="http://www.shelldorado.com/">http://www.shelldorado.com/</a>
</p>
<p>
SHELLdorado is a shell scripting education site. It features tutorials on various scripting topics and a large collection of shell scripts and functions.
</p>
</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8">Advanced Bash Scripting HOWTO</h3>
<div class="outline-text-3" id="text-2-8">

<p><a href="http://www.tldp.org/LDP/abs/html/index.html">http://www.tldp.org/LDP/abs/html/index.html</a>
</p>
<p>
The Advanced Bash Scripting HOWTO is a detailed look at bash shell programming. A thoughtful treatment with lots of examples and exercises. A good companion piece for the LinuxCommand.org tutorials.
</p>
</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9">The Bash Prompt HOWTO</h3>
<div class="outline-text-3" id="text-2-9">

<p><a href="http://www.tldp.org/HOWTO/Bash-Prompt-HOWTO/index.html">http://www.tldp.org/HOWTO/Bash-Prompt-HOWTO/index.html</a>
</p>
<p>
The Bash Prompt HOWTO is a surprisingly interesting discussion of all the things you can make the prompt do.
</p>
</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10">Linux From Scratch</h3>
<div class="outline-text-3" id="text-2-10">

<p><a href="http://www.linuxfromscratch.org/">http://www.linuxfromscratch.org/</a>
</p>
<p>
The Linux From Scratch tutorial will step you through the process of
building a complete Linux system from source code.<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"></h2>
<div class="outline-text-2" id="text-3">


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> <a href="http://linuxcommand.org/lc3_resources.php">http://linuxcommand.org/lc3_resources.php</a>
</p>


</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-30 10:07:36 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
